# Data Cleaning and Preperation
- Handling Missing data
- Data Transformation
- String Manipulation

In [1]:
import numpy as np
import pandas as pd

## 1 | Handling Missing Data

In [2]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

ðŸ“Œ `Note` - None also considered and Na value

In [4]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])
string_data
string_data.isna()
float_data = pd.Series([1, 2, None], dtype='float64')
float_data
float_data.isna()

0    False
1    False
2     True
dtype: bool

ðŸ“Œ `Important Methods` - dropna() | fillna() | forward_fill() | backword_fill()

In [5]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data
data.dropna(how = 'any', axis = 'index')

     0    1    2
0  1.0  6.5  3.0

In [11]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  0.698452       NaN       NaN
1  0.741140       NaN       NaN
2 -0.553284       NaN  0.318233
3  0.397737       NaN  0.423142
4  0.264288  0.874425 -1.928617
5  0.064068  2.079483 -0.620662
6 -1.741757  0.120477  0.494201

In [16]:
df.dropna()
df.dropna(thresh=2, axis='index')

          0         1         2
2 -0.553284       NaN  0.318233
3  0.397737       NaN  0.423142
4  0.264288  0.874425 -1.928617
5  0.064068  2.079483 -0.620662
6 -1.741757  0.120477  0.494201

In [28]:
df.dropna()
df.dropna(thresh=4, axis='columns')

          0         2
0  0.698452       NaN
1  0.741140       NaN
2 -0.553284  0.318233
3  0.397737  0.423142
4  0.264288 -1.928617
5  0.064068 -0.620662
6 -1.741757  0.494201

### | Filling Missing Data

In [29]:
df.fillna(0)

          0         1         2
0  0.698452  0.000000  0.000000
1  0.741140  0.000000  0.000000
2 -0.553284  0.000000  0.318233
3  0.397737  0.000000  0.423142
4  0.264288  0.874425 -1.928617
5  0.064068  2.079483 -0.620662
6 -1.741757  0.120477  0.494201

In [30]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.698452  0.500000  0.000000
1  0.741140  0.500000  0.000000
2 -0.553284  0.500000  0.318233
3  0.397737  0.500000  0.423142
4  0.264288  0.874425 -1.928617
5  0.064068  2.079483 -0.620662
6 -1.741757  0.120477  0.494201

In [31]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0 -0.758702  0.661666  0.904686
1 -1.411174  0.271797 -0.443313
2 -0.426981       NaN -0.256574
3  1.674547       NaN  0.412102
4  0.824123       NaN       NaN
5 -0.623304       NaN       NaN

In [32]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

ðŸ“Œ `Note` - fillna method with method attribute is depricated

In [34]:
df.ffill(axis='columns', limit=2)
df.bfill(axis='columns', limit=2)

          0         1         2
0 -0.758702  0.661666  0.904686
1 -1.411174  0.271797 -0.443313
2 -0.426981 -0.256574 -0.256574
3  1.674547  0.412102  0.412102
4  0.824123       NaN       NaN
5 -0.623304       NaN       NaN

---

## 2 | Data Transformation

In [36]:
data = pd.DataFrame(
    {
        "k1": ["one", "two"] * 3 + ["two"],
        "k2": [1, 1, 2, 3, 3, 4, 4]
    }
)
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [37]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

### | Removing Duplicates

In [38]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [40]:
data["v1"] = range(7)
data
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [41]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### | Transformaing Data using Functions or Mapping

In [42]:
data = pd.DataFrame(
    {
        "food": ["bacon", "pulled pork", "bacon",
                "pastrami", "corned beef", "bacon",
                "pastrami", "honey ham", "nova lox"],
        "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]
    }
)
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [43]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

ðŸ“Œ `Note` - map function basically used to transform the data by applying a function which iterats over entire array and transform each value, However you can pass dictonary insteed of function as well

In [46]:
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [47]:
def get_animal(x):
    return meat_to_animal[x]
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### | Replacing Values

In [48]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [49]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [50]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [51]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [52]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### | Renaming Axis Indexes

In [60]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])

In [61]:
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [62]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [63]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [4]:
import pandas as pd
# Difference between reindex and rename
df = pd.DataFrame(
    {
        "A": [1, 2, 3, 4, 5],
        "B": [6, 7, 8, 9, 10],
    }
)
df.reindex(index = [3,4,5,1,2], columns=["B", "A"])

      B    A
3   9.0  4.0
4  10.0  5.0
5   NaN  NaN
1   7.0  2.0
2   8.0  3.0

In [58]:
data.rename(index={"OHIO": "INDIANA"},
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

### | Descreatization and Binning

In [64]:
ages = [5, 20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [65]:
bins = [18, 25, 35, 60, 100]
age_categories = pd.cut(ages, bins)
age_categories

[NaN, (18.0, 25.0], (18.0, 25.0], (18.0, 25.0], (25.0, 35.0], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 13
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [66]:
age_categories.codes

array([-1,  0,  0,  0,  1,  0,  0,  2,  1,  3,  2,  2,  1], dtype=int8)

In [67]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [68]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [69]:
age_categories.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [70]:
pd.cut(ages, bins, right=False)

[NaN, [18.0, 25.0), [18.0, 25.0), [25.0, 35.0), [25.0, 35.0), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 13
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [71]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)

[NaN, 'Youth', 'Youth', 'Youth', 'YoungAdult', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 13
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [72]:
data = np.random.uniform(size=20)
pd.cut(data, 4, precision=2)

[(0.53, 0.75], (0.078, 0.3], (0.75, 0.98], (0.53, 0.75], (0.53, 0.75], ..., (0.75, 0.98], (0.53, 0.75], (0.078, 0.3], (0.3, 0.53], (0.75, 0.98]]
Length: 20
Categories (4, interval[float64, right]): [(0.078, 0.3] < (0.3, 0.53] < (0.53, 0.75] < (0.75, 0.98]]

In [74]:
data = np.random.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision=2)
quartiles
quartiles.value_counts()

(-3.2199999999999998, -0.66]    250
(-0.66, -0.054]                 250
(-0.054, 0.68]                  250
(0.68, 2.76]                    250
Name: count, dtype: int64

In [75]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.2079999999999997, -1.283]    100
(-1.283, -0.0539]                400
(-0.0539, 1.286]                 400
(1.286, 2.757]                   100
Name: count, dtype: int64

### | Detecting and Filtering Outliers
ðŸ“Œ `Note` - There are different techniques used to detect and filter outliers but here boolean indexing is used

In [80]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.036659     0.043015    -0.033597    -0.038668
std       1.008771     1.048842     0.952655     1.004665
min      -3.715976    -3.468688    -3.129586    -3.353952
25%      -0.674566    -0.705928    -0.674559    -0.691487
50%      -0.040398     0.068028    -0.024759     0.006327
75%       0.616674     0.764504     0.550447     0.634880
max       3.437815     3.040122     3.277696     3.670300

In [81]:
col = data[2]
col[col.abs() > 3]

191    3.055632
432    3.277696
978   -3.129586
Name: 2, dtype: float64

In [83]:
data[data.columns[(data.abs() > 3).any(axis="index")]]
# get an error when you do like -> data[(data.abs() > 3).any(axis="index")]

            0         1         2         3
0   -0.943298  0.424634  2.562383  1.912885
1    0.259476  0.252223 -0.114626 -0.239501
2   -0.818814  0.110146 -1.320994 -0.917041
3    0.774539 -0.626136 -1.029275 -2.565308
4   -0.501469 -0.040377  1.852481 -0.637708
..        ...       ...       ...       ...
995  0.622286  1.956169 -1.223472 -0.403333
996 -0.661878  1.155520  0.021384  1.104702
997  1.240949  0.178947 -0.260287 -0.401448
998  0.292388  0.293980  0.767754  0.502773
999 -0.524179  1.708191 -0.766772  0.662802

[1000 rows x 4 columns]

In [84]:
data[(data.abs() > 3)]
data

            0         1         2         3
0   -0.943298  0.424634  2.562383  1.912885
1    0.259476  0.252223 -0.114626 -0.239501
2   -0.818814  0.110146 -1.320994 -0.917041
3    0.774539 -0.626136 -1.029275 -2.565308
4   -0.501469 -0.040377  1.852481 -0.637708
..        ...       ...       ...       ...
995  0.622286  1.956169 -1.223472 -0.403333
996 -0.661878  1.155520  0.021384  1.104702
997  1.240949  0.178947 -0.260287 -0.401448
998  0.292388  0.293980  0.767754  0.502773
999 -0.524179  1.708191 -0.766772  0.662802

[1000 rows x 4 columns]

In [85]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0  1.0
1  1.0  1.0 -1.0 -1.0
2 -1.0  1.0 -1.0 -1.0
3  1.0 -1.0 -1.0 -1.0
4 -1.0 -1.0  1.0 -1.0

### | Permutation and Random Sampling

In [87]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [88]:
sampler = np.random.permutation(5)
sampler

array([4, 1, 3, 2, 0])

In [89]:
df.take(sampler) # Index reorder

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6

In [90]:
column_sampler = np.random.permutation(7)
column_sampler
df.take(column_sampler, axis="columns")

    6   1   3   2   0   4   5
0   6   1   3   2   0   4   5
1  13   8  10   9   7  11  12
2  20  15  17  16  14  18  19
3  27  22  24  23  21  25  26
4  34  29  31  30  28  32  33

In [91]:
df.sample(n=3)

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20

In [92]:
choices = pd.Series([5, 7, -1, 6, 4])
choices.sample(n=10, replace=True)

2   -1
0    5
4    4
3    6
2   -1
3    6
3    6
2   -1
1    7
4    4
dtype: int64

### | Feature Encoding

In [93]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df
pd.get_dummies(df["key"], dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [94]:
dummies = pd.get_dummies(df["key"], prefix="key", dtype=float)
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [95]:
pd.concat([df_with_dummy[["data1"]], dummies], axis = 1)

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [96]:
np.random.seed(12345) # to make the example repeatable
values = np.random.uniform(size=10)
values
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

---

## 3 | String Manipulation

In [103]:
s = pd.Series([1, 2, 3, None])
s
s.dtype

dtype('float64')

In [104]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())
s
s.isna()
s.dtype

Int64Dtype()

In [105]:
s[3]
s[3] is pd.NA

True

In [106]:
s = pd.Series([1, 2, 3, None], dtype="Int64")

In [107]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [108]:
df = pd.DataFrame({"A": [1, 2, None, 4],
                   "B": ["one", "two", "three", None],
                   "C": [False, None, False, True]})
df
df["A"] = df["A"].astype("Int64")
df["B"] = df["B"].astype("string")
df["C"] = df["C"].astype("boolean")
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

In [109]:
val = "a,b,  guido"
val.split(",")

['a', 'b', '  guido']

In [110]:
pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

In [111]:
first, second, third = pieces
first + "::" + second + "::" + third

'a::b::guido'

In [112]:
"::".join(pieces)

'a::b::guido'

In [113]:
"guido" in val
val.index(",")
val.find(":")

-1

In [115]:
val.count(",")

2

In [116]:
val.replace(",", "::")
val.replace(",", "")

'ab  guido'

### | Regular Expressions

In [5]:
import re
text = "foo    bar\t baz  \tqux"
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [11]:
regex = re.compile(r"\s+")
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [12]:
regex.findall(text)
# This function will return the list of matching patterns in the text.

['    ', '\t ', '  \t']

In [13]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# re.IGNORECASE makes the regex case insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [14]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [21]:
regex.search(text).group()
# Return the first match of the regular expression in the text, or None if no match is found.

'dave@google.com'

In [22]:
m = regex.search(text)
m
text[m.start():m.end()]

'dave@google.com'

In [24]:
type(regex.match(text))

NoneType

In [125]:
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [31]:
# The re.sub() function is used to replace occurrences of a pattern in a string with a specified replacement.
# Here is an example that demonstrates its use case:

# Original text containing email addresses
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""

# Pattern to match email addresses
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# re.IGNORECASE makes the regex case insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

# Using re.sub to replace email addresses with the string "REDACTED"
redacted_text = regex.sub("REDACTED", text)

# Display the modified text
print(redacted_text)

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [126]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
regex = re.compile(pattern, flags=re.IGNORECASE)

In [127]:
m = regex.match("wesm@bright.net")
m.groups()

('wesm', 'bright', 'net')

In [128]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [129]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [32]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
        "Rob": "rob@gmail.com", "Wes": np.nan}
data = pd.Series(data)
data
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [131]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [132]:
data_as_string_ext = data.astype('string')
data_as_string_ext
data_as_string_ext.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [34]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})" # () brackets are groing inside the matchine string
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [36]:
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [37]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]
matches
matches.str[1]

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [135]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [136]:
data.str.extract(pattern, flags=re.IGNORECASE) # Return a dataframe

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN